fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <basedOn>Catalog.ДоговорыКонтрагентов</basedOn>
  <registerRecords>InformationRegister.ВКМ_ВыполненныеКлиентуРаботы_Удалить</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВКМ_ВидыРаботПоЗаявкамКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ВидыРаботПоЗаявкамКлиентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Валюта</types>
    </type>
  </resources>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РезультатПроверкиПремииПроцентом = ПроверкаУстановленногоПроцентаПремии();
	
	Если ПроверкаАбонентскогоДоговора() = Ложь 
		 ИЛИ РезультатПроверкиПремииПроцентом.ПремияНазначена = Ложь
		 ИЛИ ПроверкаНаличияЗаписейВТЧВыполненныеРаботы() = Ложь 
	
	Тогда
		
		Отказ = Истина;
	
	Иначе 
		
		ВыполненныеРаботыСписок = ЭтотОбъект.ВыполненныеРаботы;
		ПремияПроцентом = РезультатПроверкиПремииПроцентом.ПремияПроцентом;
				
		СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок);
		СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ПремияПроцентом);
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаАбонентскогоДоговора() Экспорт
	
	Договор = ЭтотОбъект.Договор;
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Если ДатаВыполненияРаботНеСоответствуетДатамДоговора(Договор) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПроверкаУстановленногоПроцентаПремии() Экспорт
	
	Специалист = ЭтотОбъект.Специалист;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатСтруктура = Новый Структура;
	
	РезультатСтруктура.Вставить("ПремияНазначена");
	РезультатСтруктура.Вставить("ПремияПроцентом");
		
	Если РезультатЗапроса.Количество() <> 0 Тогда
	
		ПроцентПремии = РезультатЗапроса.ВыгрузитьКолонку("ПроцентОтРабот")[0];
		КатегорияСотрудника = РезультатЗапроса.ВыгрузитьКолонку("Категория")[0];
		
		Если КатегорияСотрудника = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
			
			Если ПроцентПремии = Неопределено ИЛИ ПроцентПремии = "" ИЛИ ПустаяСтрока(ПроцентПремии) Тогда
		
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Для сотрудника не указана премия процентом. Документ не проведен.";
				Сообщение.Сообщить();
				
				РезультатСтруктура.ПремияНазначена = Ложь;
				
			Иначе 
				
				РезультатСтруктура.ПремияНазначена = Истина;
				РезультатСтруктура.ПремияПроцентом = ПроцентПремии;
				
			КонецЕсли;
		
		Иначе 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Сотрудник не является специалистом, уполномоченным выполнять работы. Документ не проведен.";
				Сообщение.Сообщить();
				
				РезультатСтруктура.ПремияНазначена = Ложь;
		
		КонецЕсли;
		
	Иначе
		
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для сотрудника не указаны категория и премия процентом. Обратитесь к администратору.";
			Сообщение.Сообщить();
			
			РезультатСтруктура.ПремияНазначена = Ложь;
			
	КонецЕсли;
	
	Возврат РезультатСтруктура;
		
КонецФункции

Функция ПроверкаНаличияЗаписейВТЧВыполненныеРаботы() Экспорт
	
	Если ЭтотОбъект.ВыполненныеРаботы.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не внесены данные о выполненных работах.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	Иначе 
		
		Возврат Истина;
		
	КонецЕсли;
		
КонецФункции

Функция ДатаВыполненияРаботНеСоответствуетДатамДоговора(Договор) Экспорт
	
	ДатаВыполненияРабот = ЭтотОбъект.ДатаПроведенияРабот;	
	ДатаНачалаДействияДоговора = Договор.ВКМ_ДатаНачалаДействия;
	ДатаОкончанияДействияДоговора = Договор.ВКМ_ДатаОкончанияДействия;
	
	Если 	
		ДатаВыполненияРабот <= ДатаОкончанияДействияДоговора 
		И ДатаВыполненияРабот >= ДатаНачалаДействияДоговора
	Тогда
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Ложь;
	Иначе
		ДатаВыполненияРаботНеСоответствуетДатамДоговора = Истина;
	КонецЕсли;
	
	Возврат ДатаВыполненияРаботНеСоответствуетДатамДоговора;
	
КонецФункции

Процедура СоздатьДвижениеПоРегиструВыполненныеКлиентуРаботы(ВыполненныеРаботыСписок)
	
	СтоимостьНормочаса = ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();

	//++ Исправление замечаний к дипломной работе 29.07.24	
	НаборЗаписей = РегистрыНакопления.ВКМ_ВыполненныеКлиентуРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	Для Каждого Строка Из ВыполненныеРаботыСписок Цикл 
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = ЭтотОбъект.Клиент;
		Движение.КоличествоЧасов = Строка.ЧасыКОплате;
		Движение.СуммаКОплате = Строка.ЧасыКОплате * СтоимостьНормочаса;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ВидРабот = Строка.ВидРабот;
		Движение.Комментарий = Строка.Комментарий;
		
	КонецЦикла; 	
	//--
	
	НаборЗаписей.Записать();  

КонецПроцедуры

Процедура СоздатьДвижениеПоРегиструНакопленияВыполненныеСотрудникомРаботы(ПремияПроцентом)
	
	Сотрудник = ЭтотОбъект.Специалист;
	Договор = ЭтотОбъект.Договор;
	ЧасовКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате");
	СуммаКОплате = ЭтотОбъект.ВыполненныеРаботы.Итог("ЧасыКОплате")*ЭтотОбъект.Договор.ВКМ_СтоимостьЧаса*ПремияПроцентом/100;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Сотрудник = ЭтотОбъект.Специалист;
	Движение.ЧасовКОплате = ЧасовКОплате;
	Движение.СуммаКОплате = СуммаКОплате;
	Движение.Договор = Договор;
				
КонецПроцедуры;
